class Converter():
    #Меры длины и массы в СИ (метры и кг)
    SI = {
        "Длина" : {
            "Вершок": 0.044,
            "Пядь": 0.1778,
            "Локоть": 0.42,
            "Аршин": 0.7112,
            "Сажень": 2.1336,
            "Верста": 1066.8,
            "Дюйм": 0.0254,
            "Фут": 0.3048,
            "Ярд": 0.9144,
            "Миля": 1609.344,
            "Дюйм": 0.0254,
            "Фут": 0.3048,
            "Ярд": 0.9144,
            "Миля": 1609.344,
            "Миллиметр": 0.001,
            "Сантиметр": 0.01,
            "Дециметр": 0.1,
            "Метр": 1,
            "Километр": 1000,
        },
        "Масса" : {
            "Золотник": 0.00427,
            "Лот": 0.0128,
            "Пуд": 16.38,
            "Унция": 0.028,
            "Фунт": 0.454,
            "Стоун": 6.35,
            "Тонна": 1000,
            "Центнер": 100,
            "Килограмм": 1,
            "Грамм": 0.001

        }
    }

    def convert(self, type_val : str, value : float, type_source : str, type_result : str, accuracy: int = 3):
        try:
             temp = round(value * self.SI[type_val][type_source] / self.SI[type_val][type_result], accuracy)
        except:
            return
        return temp




